export const tree = {
  nodes: [
    {
      name: 'Очная',
      nodes: [
        {
          name: 'ЕГФ',
          nodes: [
            {
              name: 'Первый',
              nodes: [
                {
                  name: 'БЖ0-1',
                  nodes: [
                    {
                      member: {
                        name: 'Лебедь Дмитрий Русланович',
                        code: '18128',
                      },
                    },
                    {
                      member: {
                        name: 'Медведева Анастасия Викторовна',
                        code: '18131',
                      },
                    },
                  ],
                },
              ],
            },
            {
              name: 'Второй',
              nodes: [
                {
                  name: 'МНО-2',
                  nodes: [
                    {
                      member: {
                        name: 'Сладких Валерия Андреевна',
                        code: '19122',
                      },
                    },
                    {
                      member: {
                        name: 'Выголова Валерия Дмитриевна',
                        code: '18148',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
        {
          name: 'ФТЭД',
          nodes: [
            {
              name: 'Третий',
              nodes: [
                {
                  name: 'ФКО-3',
                  nodes: [
                    {
                      member: {
                        name: 'Амникина Василиса Александровна',
                        code: '19124',
                      },
                    },
                  ],
                },
              ],
            },
            {
              name: 'Четвертый',
              nodes: [
                {
                  name: 'БРО-4',
                  nodes: [
                    {
                      member: {
                        name: 'Леонова Алескандра Сергеевна',
                        code: '19130',
                      },
                    },
                    {
                      member: {
                        name: 'Савченко Любовь Александровна',
                        codes: '19135',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
      ],
    },

    {
      name: 'Заочная',
      nodes: [
        {
          name: 'Институт заочного и дополнительного образования',
          nodes: [
            {
              name: 'Первый',
              nodes: [
                {
                  name: 'МНЗ-1',
                  nodes: [
                    {
                      member: {
                        name: 'Блошенко Дмитрий Васильевич',
                        code: '20280',
                      },
                    },
                    { member: { name: 'Гома Юлия Николаевна', code: '20281' } },
                  ],
                },
              ],
            },
            {
              name: 'Второй',
              nodes: [
                {
                  name: 'ГНЗ-2',
                  nodes: [
                    {
                      member: { name: 'Руфа Ольга Георгиевна', code: '20282' },
                    },
                    {
                      member: {
                        name: 'Ярославцев Роман Валерьевич',
                        code: '202283',
                      },
                    },
                  ],
                },
              ],
            },
            {
              name: 'Третий',
              nodes: [
                {
                  name: 'МНЗ-3',
                  nodes: [
                    {
                      member: {
                        name: 'Баскакова Ирина Викторовна',
                        code: '20284',
                      },
                    },
                    {
                      member: {
                        name: 'Клян Дмитрий Леонидович',
                        code: '20285',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
      ],
    },
  ],
};

export const filteredTree = {
  nodes: [
    {
      name: 'Очная',
      nodes: [
        {
          name: 'ЕГФ',
          nodes: [
            {
              name: 'Второй',
              nodes: [
                {
                  name: 'МНО-2',
                  nodes: [
                    {
                      member: {
                        name: 'Сладких Валерия Андреевна',
                        code: '19122',
                      },
                    },
                    {
                      member: {
                        name: 'Выголова Валерия Дмитриевна',
                        code: '18148',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
        {
          name: 'ФТЭД',
          nodes: [
            {
              name: 'Третий',
              nodes: [
                {
                  name: 'ФКО-3',
                  nodes: [
                    {
                      member: {
                        name: 'Амникина Василиса Александровна',
                        code: '19124',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
      ],
    },

    {
      name: 'Заочная',
      nodes: [
        {
          name: 'Институт заочного и дополнительного образования',
          nodes: [
            {
              name: 'Первый',
              nodes: [
                {
                  name: 'МНЗ-1',
                  nodes: [
                    {
                      member: {
                        name: 'Блошенко Дмитрий Васильевич',
                        code: '20280',
                      },
                    },
                    { member: { name: 'Гома Юлия Николаевна', code: '20281' } },
                  ],
                },
              ],
            },
            {
              name: 'Третий',
              nodes: [
                {
                  name: 'МНЗ-3',
                  nodes: [
                    {
                      member: {
                        name: 'Баскакова Ирина Викторовна',
                        code: '20284',
                      },
                    },
                    {
                      member: {
                        name: 'Клян Дмитрий Леонидович',
                        code: '20285',
                      },
                    },
                  ],
                },
              ],
            },
          ],
        },
      ],
    },
  ],
};
